## 04. 인덱싱

## 참고자료
* [Python 완전정복 시리즈] 2편 : Pandas DataFrame 완전정복 : https://wikidocs.net/book/7188

In [1]:
import pandas as pd
import numpy as np

## 레이블기반_스칼라

In [6]:
df = pd.DataFrame([[1,2], [3,4]], index=['row1', 'row2'], columns=['col1', 'col2'])
df

      col1  col2
row1     1     2
row2     3     4

In [7]:
result = df.at['row1', 'col2']
result

2

In [8]:
df.at['row2', 'col1'] = '변경'
df

     col1  col2
row1    1     2
row2   변경     4

In [9]:
df.loc['row2'].at['col2']

4

## 레이블기반_데이터

In [10]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index=['row1', 'row2', 'row3'], columns=['col1', 'col2', 'col3'])
df

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [11]:
df.loc['row1']

col1    1
col2    2
col3    3
Name: row1, dtype: int64

In [12]:
df.loc[['row1', 'row3']]

      col1  col2  col3
row1     1     2     3
row3     7     8     9

In [14]:
df.loc['row2', 'col2']

5

In [19]:
df.loc['row1': 'row3', 'col2']

row1    2
row2    5
row3    8
Name: col2, dtype: int64

In [23]:
bool = [False, True, False]
df.loc[bool]

      col1  col2  col3
row2     4     5     6

In [24]:
df.loc[df['col3'] > 5]

      col1  col2  col3
row2     4     5     6
row3     7     8     9

In [25]:
df.loc[df['col3'] > 5, ['col2']]

      col2
row2     5
row3     8

In [26]:
df.loc[lambda df : df['col2'] == 5]

      col1  col2  col3
row2     4     5     6

## 정수기반_스칼라

In [29]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index=['row1', 'row2', 'row3'], columns=['col1', 'col2', 'col3'])
df

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [30]:
df.iat[1,2]

6

In [31]:
# 0부터 시작하므로 주의

df.iat[1,2] = 'A'
df

      col1  col2 col3
row1     1     2    3
row2     4     5    A
row3     7     8    9

## 정수기반_데이터

In [32]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index=['row1', 'row2', 'row3'], columns=['col1', 'col2', 'col3'])
df

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [33]:
df.iloc[0]

col1    1
col2    2
col3    3
Name: row1, dtype: int64

In [34]:
df.iloc[[0,2]]

      col1  col2  col3
row1     1     2     3
row3     7     8     9

In [35]:
df.iloc[1:2]

      col1  col2  col3
row2     4     5     6

In [36]:
bool_list = [True, False, True]
df.iloc[bool_list]

      col1  col2  col3
row1     1     2     3
row3     7     8     9

## 앞에서 n행 인덱싱

In [40]:
data = np.random.randint(10,size=(10,10))
df = pd.DataFrame(data=data)
df

   0  1  2  3  4  5  6  7  8  9
0  7  1  8  5  1  7  0  1  2  6
1  1  8  3  0  4  5  0  1  8  0
2  9  7  8  5  2  3  0  2  7  8
3  7  2  5  8  2  2  7  2  7  2
4  6  6  1  9  5  7  4  5  0  5
5  6  8  9  2  7  2  0  8  5  0
6  6  5  6  5  9  5  7  5  8  2
7  2  0  4  4  8  7  3  3  4  0
8  4  0  1  3  9  2  0  0  9  2
9  2  1  1  9  8  3  5  7  3  3

In [41]:
df.head(3)

   0  1  2  3  4  5  6  7  8  9
0  7  1  8  5  1  7  0  1  2  6
1  1  8  3  0  4  5  0  1  8  0
2  9  7  8  5  2  3  0  2  7  8

In [42]:
# n이 음수면 DataFrame 끝에서부터 n개열을 제외하고 반환

df.head(-3)

   0  1  2  3  4  5  6  7  8  9
0  7  1  8  5  1  7  0  1  2  6
1  1  8  3  0  4  5  0  1  8  0
2  9  7  8  5  2  3  0  2  7  8
3  7  2  5  8  2  2  7  2  7  2
4  6  6  1  9  5  7  4  5  0  5
5  6  8  9  2  7  2  0  8  5  0
6  6  5  6  5  9  5  7  5  8  2

## 뒤에서 n행 인덱싱

In [43]:
data = np.random.randint(10,size=(10,10))
df = pd.DataFrame(data=data)
df

   0  1  2  3  4  5  6  7  8  9
0  9  0  4  2  6  4  5  7  1  2
1  2  0  0  7  4  2  6  0  1  8
2  4  3  7  5  2  1  8  7  2  8
3  3  0  5  5  7  4  0  5  8  6
4  7  4  2  3  9  4  5  3  5  1
5  9  6  8  3  0  6  1  6  9  8
6  3  4  0  9  1  0  6  5  3  0
7  2  0  2  9  8  7  0  4  4  0
8  8  2  1  8  3  4  6  9  7  4
9  0  8  2  0  4  2  8  4  3  7

In [45]:
df.tail(3)

   0  1  2  3  4  5  6  7  8  9
7  2  0  2  9  8  7  0  4  4  0
8  8  2  1  8  3  4  6  9  7  4
9  0  8  2  0  4  2  8  4  3  7

In [46]:
# n이 음수면 DataFrame의 위에서부터 n개열을 제외하고 반환

df.tail(-3)

   0  1  2  3  4  5  6  7  8  9
3  3  0  5  5  7  4  0  5  8  6
4  7  4  2  3  9  4  5  3  5  1
5  9  6  8  3  0  6  1  6  9  8
6  3  4  0  9  1  0  6  5  3  0
7  2  0  2  9  8  7  0  4  4  0
8  8  2  1  8  3  4  6  9  7  4
9  0  8  2  0  4  2  8  4  3  7

In [47]:
check = df.tail(3)
print(check.index)

RangeIndex(start=7, stop=10, step=1)

## Multi Index

In [49]:
index_tuples = [('row1', 'val1'), ('row1', 'val2'), ('row2', 'val1'), ('row2', 'val2'), ('row2', 'val3'), ('row3', 'val2'),('row3', 'val3')]
values = [ [1,2,3], [4,5,6], [7,8,9], [10,11,12], [13,14,15], [16,17,18], [19,20,21]]
index = pd.MultiIndex.from_tuples(index_tuples) # 인덱스 설정
df = pd.DataFrame(values, columns=['col1', 'col2', 'col3'], index = index)
df

           col1  col2  col3
row1 val1     1     2     3
     val2     4     5     6
row2 val1     7     8     9
     val2    10    11    12
     val3    13    14    15
row3 val2    16    17    18
     val3    19    20    21

In [50]:
df.loc['row2']

      col1  col2  col3
val1     7     8     9
val2    10    11    12
val3    13    14    15

In [55]:
df.loc['row2', 'val2']

col1    10
col2    11
col3    12
Name: (row2, val2), dtype: int64

In [57]:
df.loc[[('row2', 'val2')]]

# Q. () 형태가 아닐때 df.loc[['row2', 'val2']] 오류 나는 이유에 대해서 찾아 볼 것

           col1  col2  col3
row2 val2    10    11    12

In [62]:
df.loc[('row2','val2'), 'col3']

12

In [63]:
df.loc[('row1','val2') : ('row3','val2')]

           col1  col2  col3
row1 val2     4     5     6
row2 val1     7     8     9
     val2    10    11    12
     val3    13    14    15
row3 val2    16    17    18